/*
	åœ†å‘¨ç‡çš„ç»Ÿè®¡é¢„æµ‹ï¼Œé¦–å…ˆæŠŠéªŒè¯æ¢…é’¦ç±»å…¬å¼çš„å‡†ç¡®æ€§å°è£…ä¸ºä¸€ä¸ªå¤´æ–‡ä»¶.
	ç„¶å,åšç®€å•çš„ç»Ÿè®¡åˆ†æ,ç»“åˆMATLAB.
											ZLC,2020/6/16
*/

#include <iostream>
#include <Windows.h>
#include "Mrate.h"
#define N 800
#define M 1000

using namespace std;

int main(void) {
<<<<<<< HEAD
	int cdata[N]; // ÑµÁ·Êı¾İÔª×é
	//int rdata[M]; // Ñù±¾×ÜÌåÔª×é
	int * frequency; // Æµ¶ÈÍ³¼Æ
	// Ê¹ÓÃÃ·ÇÕÀà¹«Ê½Éú³ÉPIµÄÇ°800Î»£¨ÈçºÎµ÷²ÎÉú³ÉÇ°1000Î»µÄPIÖµ£©
=======
	int data[N]; // æ•°æ®å…ƒç»„
	int frequency[10]; // é¢‘åº¦ç»Ÿè®¡å…ƒç»„
	// ä½¿ç”¨æ¢…é’¦ç±»å…¬å¼ç”ŸæˆPIçš„å‰800ä½ï¼ˆå¦‚ä½•è°ƒå‚ç”Ÿæˆå‰1000ä½çš„PIå€¼ï¼‰
>>>>>>> 853e1a5a911bdbad233fa855c76dafb5e04b398f
	Machin();
	// è¯»å–çœŸå®PIå€¼çš„å‰1000ä½
	readTxt("realPI.txt");
	// éªŒè¯æ¢…é’¦ç±»å…¬å¼çš„piå€¼çš„æ­£ç¡®æ€§
	cout<< "æ¢…é’¦ç±»å…¬å¼çš„piå€¼çš„å‡†ç¡®ç‡: " << rate(comparestr()) << "%" << endl;

<<<<<<< HEAD
	/* Í³¼Æ·ÖÎö */
	cout << "********************************************** ³õ²½·ÖÎö **********************************************" << endl;
	// 1.Êı¾İÔ¤´¦Àí
	preprocessing(cdata, N);
	// preprocessing(rdata, M);
	// ¿¼ÂÇÈıÔª×é´æ´¢0~9µÄÎ»ÖÃĞÅÏ¢(Á´±í??)

	// 2.Êı×ÖÆµ¶ÈÍ³¼Æ : ÄÜ·ñ×ö³öÒ»¸ö¶¯Ì¬µÄÄØ?
	frequency = frequentness(N, cdata);
=======
	/* ç»Ÿè®¡åˆ†æ */
	cout << "********************************************** ç»Ÿè®¡åˆ†æ **********************************************" << endl;
	// 1.æ•°æ®é¢„å¤„ç†
	preprocessing(data);
>>>>>>> 853e1a5a911bdbad233fa855c76dafb5e04b398f
	/*
	for (int i = 0; i < 10; i++) {
		cout << frequency[i] << endl;
	}
<<<<<<< HEAD
	/* Ê¹ÓÃÊ±¼äĞòÁĞÔ¤²âÊÇÀ§ÄÑµÄ,ÄÇÃ´Ê¹ÓÃÖÇÄÜËã·¨ÄØ?
=======
	cout<< endl;
	*/
	// 2.æ•°å­—é¢‘åº¦ç»Ÿè®¡
	memset(frequency,0,sizeof(frequency)); // åˆå§‹åŒ–,å¾—åˆ°ä¸€ä¸ªå…¨é›¶çš„é¢‘åº¦ç»Ÿè®¡å…ƒç»„
>>>>>>> 853e1a5a911bdbad233fa855c76dafb5e04b398f
	for (int i = 0; i < N; i++) {
		cout << cdata[i] << endl;
	}
<<<<<<< HEAD
	*/
	// frequentness(M, rdata);
	// 3.»­³öÆµ¶ÈÍ¼Ïñ : ÔİÊ±Ê¡ÂÔ´ó²¿·Ö,ÖÆ×÷¾¥Ò¶Í¼
	CaulineLeafFigure(frequency);

	cout << "********************************************** Í³¼Æ·ÖÎö **********************************************" << endl;
	/* µÚ1ÕÂ	±äÁ¿ÓëÊı¾İ*/
	/*
		ÔõÃ´Ê¹ÓÃC++Ä£Äâ³éÇ©??
		Ê¹ÓÃC++Ä£Äâ¼òµ¥³éÑù:(±£Ö¤ÁËÃ¿¸öÔªËØ¶¼ÓĞÏàÍ¬µÄ»ú»á³éµ½)
			ÄÜ·ñµÃµ½Ò»¸öº¯Êı,È»ºóµÃµ½Ëæ»úÊı²¢´úÈë¸Ãº¯ÊıÔËËã,×îºóµÃµ½µÄ½á¹ûÊÇ
	    ·ûºÏ¸Ã¹æÔò³éÇ©µÄ¸ÅÂÊ·Ö²¼µÄ.
			ÄÇÃ´¸Ã³éÇ©½á¹ûµÄÊı¾İÓÖ³ÊÊ²Ã´ÀàĞÍµÄÊı¾İ½á¹¹?
		×ÜÌå: n;	Ñù±¾: m;
		ÖØ¸´³éÑù: ·Å»ØÊ½³éÑù;	²»ÖØ¸´³éÑù: ²»·Å»Ø³éÑù.
		Ä¬ÈÏ: 
			¢Ù n>m; ¢Ú ³ém´Î;

	*/
	cout << "¼òµ¥³éÑù" << endl; 

	/*
			°ÑÒÑÖªµÄÒ»²¿·ÖĞÅÏ¢(¸ÃĞÅÏ¢×ÜÌåÎªn)°´ÕÕÄ³ÖÖ¹æÔò»®·ÖÎªk²ã,
		È»ºó,´Ó¸÷²ãÖĞ³éÈ¡Ò»¶¨ÊıÁ¿µÄÔªËØ,×é³É¹æÄ£ÎªmµÄÑù±¾.
	*/
	cout << "·Ö²ã³éÑù" << endl;

	/*
			°´ÕÕÄ³ÖÖË³ĞòÅÅÁĞµÄĞÅÏ¢Á¿Îªn×ÜÌå,Ëæ»úµÃµ½Ò»¸ö³õÊ¼µã,
		È»ºóµÈ¾à³éÈ¡m¸öÔªËØ.
	*/
	cout << "ÏµÍ³³éÑù" << endl;

	/*
			ÏÈ½«×ÜÌå»®·ÖÎªÈô¸ÉÈº(n),È»ºóËæ»ú³éÈ¡²¿·ÖÈº(m).
	*/
	cout << "ÕûÈº³éÑù" << endl;

	/* µÚ2ÕÂ	Ê¹ÓÃÍ¼±íÕ¹Ê¾Êı¾İ*/
	cout << "Éú³ÉÆµÊı·Ö²¼±í" << endl;
	cout << "¾¥Ò¶Í¼" << endl;
	cout << "ÏäÏßÍ¼" << endl;
	cout << "É¢µãÍ¼" << endl;

	/* µÚ3ÕÂ	Ê¹ÓÃÍ³¼ÆÁ¿ÃèÊöÊı¾İ*/
	cout << "Æ½¾ùÊı" << endl;
	cout << "¼ÓÈ¨Æ½¾ùÊı" << endl;
	cout << "·ÖÎ»Êı" << endl;
	cout << "ÖĞÎ»Êı" << endl;
	cout << "ËÄ·ÖÎ»Êı" << endl;
	cout << "°Ù·ÖÎ»Êı" << endl;
	cout << "ÖÚÊı" << endl;
	cout << "¼«²î" << endl;
	cout << "ËÄ·ÖÎ»²î" << endl;
	cout << "±ê×¼²î" << endl;
	cout << "·½²î" << endl;
	cout << "±ê×¼·ÖÊı" << endl;
	cout << "ÀëÉ¢ÏµÊı" << endl;
	cout << "Æ«Ì¬" << endl;
	cout << "·åÌ¬" << endl;

	/* µÚ4ÕÂ	¸ÅÂÊ·Ö²¼*/
	cout << "¶ÈÁ¿ÊÂ¼ş·¢ÉúµÄ¿ÉÄÜĞÔ" << endl;
	cout << "ÆÚÍûÖµ" << endl;
	cout << "Ö¸Êı·Ö²¼" << endl;
	cout << "¶şÏî·Ö²¼" << endl;
	cout << "²´ËÉ·Ö²¼" << endl;
	cout << "³¬¼¸ºÎ·Ö²¼" << endl;
	cout << "t·Ö²¼" << endl;
	cout << "¿¨·½·Ö²¼" << endl;
	cout << "F·Ö²¼" << endl;
	cout << "Í³¼ÆÁ¿µÄ±ê×¼Îó²î" << endl;

	/* µÚ5ÕÂ	²ÎÊı¹À¼Æ*/
	cout << "µã¹À¼Æ" << endl;
	cout << "Çø¼ä¹À¼Æ" << endl;
	cout << "ÖÃĞÅÇø¼ä" << endl;
	cout << "ÆÀ¼Û¹À¼ÆÁ¿µÄ±ê×¼" << endl;

	/* µÚ6ÕÂ	¼ÙÉè¼ìÑé*/
	/* µÚ7ÕÂ	Àà±ğ±äÁ¿µÄÍÆ¶Ï*/
	/* µÚ8ÕÂ	·½²î·ÖÎöÓëÊÔÑéÉè¼Æ*/
	/* µÚ9ÕÂ	Ò»ÔªÏßĞÔ»Ø¹é*/
	/* µÚ10ÕÂ	¶àÔªÏßĞÔ»Ø¹é*/
	/* µÚ11ÕÂ	Ê±¼äĞòÁĞÔ¤²â*/
	/* µÚ12ÕÂ	·Ç²ÎÊı¼ìÑé*/
=======
	// 3.ç”»å‡ºé¢‘åº¦å›¾åƒ
>>>>>>> 853e1a5a911bdbad233fa855c76dafb5e04b398f

	system("pause");

	return 0;
}

